//画图充分理解
#include<stdio.h>
int main()
{
    long long f[25][25]={0};//记录路线，记得初始化
    int g[25][25];//记录是否可走
    int x1,y1,x2,y2;
    scanf("%d %d",&x1,&y1);
    scanf("%d %d",&x2,&y2);
    g[x2][y2]=1;
    //记录控制点
    //走竖着的日字
    //左边的边界情况
    if(x2 > 1 && y2 != 0)   g[x2 - 2][y2 - 1] = 1;//向左上方走
	if(x2 < 19 && y2 != 0)  g[x2 + 2][y2 - 1] = 1;//向左下方走
    //右边的边界情况
	if(x2 > 1 && y2 != 20)  g[x2 - 2][y2 + 1] = 1;//向右上方走
	if(x2 < 19 && y2 != 20) g[x2 + 2][y2 + 1] = 1;//向右下方走
    //走横着的日字
    //左边的边界情况
	if(x2 != 0 && y2 > 1)   g[x2 - 1][y2 - 2] = 1;
	if(x2 != 0 && y2 < 19)  g[x2 - 1][y2 + 2] = 1;
    //右边的边界情况
	if(x2 != 20 && y2 > 1)  g[x2 + 1][y2 - 2] = 1;
	if(x2 != 20 && y2 < 19) g[x2 + 1][y2 + 2] = 1;
    //递推过程
    for(int i=0;i<=x1;i++)
    {
        for(int j=0;j<=y1;j++)
        {
            if(!g[i][j])//该点没有被马控制
            {
                if(i==0 && j==0)//递推边界1
                    f[0][0]=1;
                else if (i==0 && j>0)//递推边界2，x=0时；
                    f[0][j]=f[0][j-1];
                else if (i>0 && j==0)//递推边界3，y=0时；
                    f[i][0]=f[i-1][0];
                else
                {
                    f[i][j]=f[i-1][j]+f[i][j-1];//核心公式
                }
                
            }
        }
    }
    printf("%lld",f[x1][y1]);
    return 0;
}